hunt/baseCase/basecase_mhdEpotMultiRegionFoam_Ha20_strongScaling_80k_20k_spr-hbm/0/fluid/PotE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      PotE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    topWall
    {
        type            coupledPotential;
        value           uniform 0;
    }
    botWall
    {
        type            coupledPotential;
        value           uniform 0;
    }
    frontWall
    {
        type            zeroGradient;
    }
    backWall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }         
}


// ************************************************************************* //
